OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16lf1575.h
#define _PWM1PRL0               0x01
#define _PWM1PRL1               0x02
#define _PWM1PRL2               0x04
#define _PWM1PRL3               0x08
#define _PWM1PRL4               0x10
#define _PWM1PRL5               0x20
#define _PWM1PRL6               0x40
#define _PWM1PRL7               0x80

//==============================================================================


//==============================================================================
//        PWM1PRH Bits

extern __at(0x0D96) __sfr PWM1PRH;

typedef struct
  {
  unsigned PWM1PRH0             : 1;
  unsigned PWM1PRH1             : 1;
  unsigned PWM1PRH2             : 1;
  unsigned PWM1PRH3             : 1;
  unsigned PWM1PRH4             : 1;
  unsigned PWM1PRH5             : 1;
  unsigned PWM1PRH6             : 1;
  unsigned PWM1PRH7             : 1;
  } __PWM1PRHbits_t;

extern __at(0x0D96) volatile __PWM1PRHbits_t PWM1PRHbits;

#define _PWM1PRH0               0x01
#define _PWM1PRH1               0x02
#define _PWM1PRH2               0x04
#define _PWM1PRH3               0x08
#define _PWM1PRH4               0x10
#define _PWM1PRH5               0x20
#define _PWM1PRH6               0x40
#define _PWM1PRH7               0x80

//==============================================================================

extern __at(0x0D97) __sfr PWM1OF;

//==============================================================================
//        PWM1OFL Bits

extern __at(0x0D97) __sfr PWM1OFL;

typedef struct
  {
  unsigned PWM1OFL0             : 1;
  unsigned PWM1OFL1             : 1;
  unsigned PWM1OFL2             : 1;
  unsigned PWM1OFL3             : 1;
  unsigned PWM1OFL4             : 1;
  unsigned PWM1OFL5             : 1;
  unsigned PWM1OFL6             : 1;
  unsigned PWM1OFL7             : 1;
  } __PWM1OFLbits_t;

extern __at(0x0D97) volatile __PWM1OFLbits_t PWM1OFLbits;

#define _PWM1OFL0               0x01
#define _PWM1OFL1               0x02
#define _PWM1OFL2               0x04
#define _PWM1OFL3               0x08
#define _PWM1OFL4               0x10
#define _PWM1OFL5               0x20
#define _PWM1OFL6               0x40
#define _PWM1OFL7               0x80

//==============================================================================


//==============================================================================
//        PWM1OFH Bits

extern __at(0x0D98) __sfr PWM1OFH;

typedef struct
  {
  unsigned PWM1OFH0             : 1;
  unsigned PWM1OFH1             : 1;
  unsigned PWM1OFH2             : 1;
  unsigned PWM1OFH3             : 1;
  unsigned PWM1OFH4             : 1;
  unsigned PWM1OFH5             : 1;
  unsigned PWM1OFH6             : 1;
  unsigned PWM1OFH7             : 1;
  } __PWM1OFHbits_t;

extern __at(0x0D98) volatile __PWM1OFHbits_t PWM1OFHbits;

#define _PWM1OFH0               0x01
#define _PWM1OFH1               0x02
#define _PWM1OFH2               0x04
#define _PWM1OFH3               0x08
#define _PWM1OFH4               0x10
#define _PWM1OFH5               0x20
#define _PWM1OFH6               0x40
#define _PWM1OFH7               0x80

//==============================================================================

extern __at(0x0D99) __sfr PWM1TMR;

//==============================================================================
//        PWM1TMRL Bits

extern __at(0x0D99) __sfr PWM1TMRL;

typedef struct
  {
  unsigned PWM1TMRL0            : 1;
  unsigned PWM1TMRL1            : 1;
  unsigned PWM1TMRL2            : 1;
  unsigned PWM1TMRL3            : 1;
  unsigned PWM1TMRL4            : 1;
  unsigned PWM1TMRL5            : 1;
  unsigned PWM1TMRL6            : 1;
  unsigned PWM1TMRL7            : 1;
  } __PWM1TMRLbits_t;

extern __at(0x0D99) volatile __PWM1TMRLbits_t PWM1TMRLbits;

#define _PWM1TMRL0              0x01
#define _PWM1TMRL1              0x02
#define _PWM1TMRL2              0x04
#define _PWM1TMRL3              0x08
#define _PWM1TMRL4              0x10
#define _PWM1TMRL5              0x20
#define _PWM1TMRL6              0x40
#define _PWM1TMRL7              0x80

//==============================================================================


//==============================================================================
//        PWM1TMRH Bits

extern __at(0x0D9A) __sfr PWM1TMRH;

typedef struct
  {
  unsigned PWM1TMRH0            : 1;
  unsigned PWM1TMRH1            : 1;
  unsigned PWM1TMRH2            : 1;
  unsigned PWM1TMRH3            : 1;
  unsigned PWM1TMRH4            : 1;
  unsigned PWM1TMRH5            : 1;
  unsigned PWM1TMRH6            : 1;
  unsigned PWM1TMRH7            : 1;
  } __PWM1TMRHbits_t;

extern __at(0x0D9A) volatile __PWM1TMRHbits_t PWM1TMRHbits;

#define _PWM1TMRH0              0x01
#define _PWM1TMRH1              0x02
#define _PWM1TMRH2              0x04
#define _PWM1TMRH3              0x08
#define _PWM1TMRH4              0x10
#define _PWM1TMRH5              0x20
#define _PWM1TMRH6              0x40
#define _PWM1TMRH7              0x80

//==============================================================================


//==============================================================================
//        PWM1CON Bits

extern __at(0x0D9B) __sfr PWM1CON;

typedef union
  {
  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned PWM1MODE0          : 1;
    unsigned PWM1MODE1          : 1;
    unsigned POL                : 1;
    unsigned OUT                : 1;
    unsigned OE                 : 1;
    unsigned EN                 : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned MODE0              : 1;
    unsigned MODE1              : 1;
    unsigned PWM1POL            : 1;
    unsigned PWM1OUT            : 1;
    unsigned PWM1OE             : 1;
    unsigned PWM1EN             : 1;
    };

  struct
    {
    unsigned                    : 2;
    unsigned PWM1MODE           : 2;
    unsigned                    : 4;
    };

  struct
    {
    unsigned                    : 2;
    unsigned MODE               : 2;
    unsigned                    : 4;
    };
  } __PWM1CONbits_t;

extern __at(0x0D9B) volatile __PWM1CONbits_t PWM1CONbits;

