OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16lf1575.h
#define _PWM1MODE0              0x04
#define _MODE0                  0x04
#define _PWM1MODE1              0x08
#define _MODE1                  0x08
#define _POL                    0x10
#define _PWM1POL                0x10
#define _OUT                    0x20
#define _PWM1OUT                0x20
#define _OE                     0x40
#define _PWM1OE                 0x40
#define _EN                     0x80
#define _PWM1EN                 0x80

//==============================================================================


//==============================================================================
//        PWM1INTCON Bits

extern __at(0x0D9C) __sfr PWM1INTCON;

typedef union
  {
  struct
    {
    unsigned PRIE               : 1;
    unsigned DCIE               : 1;
    unsigned PHIE               : 1;
    unsigned OFIE               : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned PWM1PRIE           : 1;
    unsigned PWM1DCIE           : 1;
    unsigned PWM1PHIE           : 1;
    unsigned PWM1OFIE           : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };
  } __PWM1INTCONbits_t;

extern __at(0x0D9C) volatile __PWM1INTCONbits_t PWM1INTCONbits;

#define _PRIE                   0x01
#define _PWM1PRIE               0x01
#define _DCIE                   0x02
#define _PWM1DCIE               0x02
#define _PHIE                   0x04
#define _PWM1PHIE               0x04
#define _OFIE                   0x08
#define _PWM1OFIE               0x08

//==============================================================================


//==============================================================================
//        PWM1INTE Bits

extern __at(0x0D9C) __sfr PWM1INTE;

typedef union
  {
  struct
    {
    unsigned PRIE               : 1;
    unsigned DCIE               : 1;
    unsigned PHIE               : 1;
    unsigned OFIE               : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned PWM1PRIE           : 1;
    unsigned PWM1DCIE           : 1;
    unsigned PWM1PHIE           : 1;
    unsigned PWM1OFIE           : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };
  } __PWM1INTEbits_t;

extern __at(0x0D9C) volatile __PWM1INTEbits_t PWM1INTEbits;

#define _PWM1INTE_PRIE          0x01
#define _PWM1INTE_PWM1PRIE      0x01
#define _PWM1INTE_DCIE          0x02
#define _PWM1INTE_PWM1DCIE      0x02
#define _PWM1INTE_PHIE          0x04
#define _PWM1INTE_PWM1PHIE      0x04
#define _PWM1INTE_OFIE          0x08
#define _PWM1INTE_PWM1OFIE      0x08

//==============================================================================


//==============================================================================
//        PWM1INTF Bits

extern __at(0x0D9D) __sfr PWM1INTF;

typedef union
  {
  struct
    {
    unsigned PRIF               : 1;
    unsigned DCIF               : 1;
    unsigned PHIF               : 1;
    unsigned OFIF               : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned PWM1PRIF           : 1;
    unsigned PWM1DCIF           : 1;
    unsigned PWM1PHIF           : 1;
    unsigned PWM1OFIF           : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };
  } __PWM1INTFbits_t;

extern __at(0x0D9D) volatile __PWM1INTFbits_t PWM1INTFbits;

#define _PRIF                   0x01
#define _PWM1PRIF               0x01
#define _DCIF                   0x02
#define _PWM1DCIF               0x02
#define _PHIF                   0x04
#define _PWM1PHIF               0x04
#define _OFIF                   0x08
#define _PWM1OFIF               0x08

//==============================================================================


//==============================================================================
//        PWM1INTFLG Bits

extern __at(0x0D9D) __sfr PWM1INTFLG;

typedef union
  {
  struct
    {
    unsigned PRIF               : 1;
    unsigned DCIF               : 1;
    unsigned PHIF               : 1;
    unsigned OFIF               : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned PWM1PRIF           : 1;
    unsigned PWM1DCIF           : 1;
    unsigned PWM1PHIF           : 1;
    unsigned PWM1OFIF           : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };
  } __PWM1INTFLGbits_t;

extern __at(0x0D9D) volatile __PWM1INTFLGbits_t PWM1INTFLGbits;

#define _PWM1INTFLG_PRIF        0x01
#define _PWM1INTFLG_PWM1PRIF    0x01
#define _PWM1INTFLG_DCIF        0x02
#define _PWM1INTFLG_PWM1DCIF    0x02
#define _PWM1INTFLG_PHIF        0x04
#define _PWM1INTFLG_PWM1PHIF    0x04
#define _PWM1INTFLG_OFIF        0x08
#define _PWM1INTFLG_PWM1OFIF    0x08

//==============================================================================


//==============================================================================
//        PWM1CLKCON Bits

extern __at(0x0D9E) __sfr PWM1CLKCON;

typedef union
  {
  struct
    {
    unsigned PWM1CS0            : 1;
    unsigned PWM1CS1            : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned PWM1PS0            : 1;
    unsigned PWM1PS1            : 1;
    unsigned PWM1PS2            : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned CS0                : 1;
    unsigned CS1                : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned PS0                : 1;
    unsigned PS1                : 1;
    unsigned PS2                : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned PWM1CS             : 2;
    unsigned                    : 6;
    };

  struct
    {
    unsigned CS                 : 2;
    unsigned                    : 6;
    };

  struct
    {
    unsigned                    : 4;
    unsigned PS                 : 3;
    unsigned                    : 1;
    };

  struct
    {
    unsigned                    : 4;
    unsigned PWM1PS             : 3;
    unsigned                    : 1;
    };
  } __PWM1CLKCONbits_t;

