OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16lf1575.h
extern __at(0x0DCD) __sfr PWM4INTF;

typedef union
  {
  struct
    {
    unsigned PRIF               : 1;
    unsigned DCIF               : 1;
    unsigned PHIF               : 1;
    unsigned OFIF               : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned PWM4PRIF           : 1;
    unsigned PWM4DCIF           : 1;
    unsigned PWM4PHIF           : 1;
    unsigned PWM4OFIF           : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };
  } __PWM4INTFbits_t;

extern __at(0x0DCD) volatile __PWM4INTFbits_t PWM4INTFbits;

#define _PWM4INTF_PRIF          0x01
#define _PWM4INTF_PWM4PRIF      0x01
#define _PWM4INTF_DCIF          0x02
#define _PWM4INTF_PWM4DCIF      0x02
#define _PWM4INTF_PHIF          0x04
#define _PWM4INTF_PWM4PHIF      0x04
#define _PWM4INTF_OFIF          0x08
#define _PWM4INTF_PWM4OFIF      0x08

//==============================================================================


//==============================================================================
//        PWM4INTFLG Bits

extern __at(0x0DCD) __sfr PWM4INTFLG;

typedef union
  {
  struct
    {
    unsigned PRIF               : 1;
    unsigned DCIF               : 1;
    unsigned PHIF               : 1;
    unsigned OFIF               : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned PWM4PRIF           : 1;
    unsigned PWM4DCIF           : 1;
    unsigned PWM4PHIF           : 1;
    unsigned PWM4OFIF           : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };
  } __PWM4INTFLGbits_t;

extern __at(0x0DCD) volatile __PWM4INTFLGbits_t PWM4INTFLGbits;

#define _PWM4INTFLG_PRIF        0x01
#define _PWM4INTFLG_PWM4PRIF    0x01
#define _PWM4INTFLG_DCIF        0x02
#define _PWM4INTFLG_PWM4DCIF    0x02
#define _PWM4INTFLG_PHIF        0x04
#define _PWM4INTFLG_PWM4PHIF    0x04
#define _PWM4INTFLG_OFIF        0x08
#define _PWM4INTFLG_PWM4OFIF    0x08

//==============================================================================


//==============================================================================
//        PWM4CLKCON Bits

extern __at(0x0DCE) __sfr PWM4CLKCON;

typedef union
  {
  struct
    {
    unsigned PWM4CS0            : 1;
    unsigned PWM4CS1            : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned PWM4PS0            : 1;
    unsigned PWM4PS1            : 1;
    unsigned PWM4PS2            : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned CS0                : 1;
    unsigned CS1                : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned PS0                : 1;
    unsigned PS1                : 1;
    unsigned PS2                : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned CS                 : 2;
    unsigned                    : 6;
    };

  struct
    {
    unsigned PWM4CS             : 2;
    unsigned                    : 6;
    };

  struct
    {
    unsigned                    : 4;
    unsigned PS                 : 3;
    unsigned                    : 1;
    };

  struct
    {
    unsigned                    : 4;
    unsigned PWM4PS             : 3;
    unsigned                    : 1;
    };
  } __PWM4CLKCONbits_t;

extern __at(0x0DCE) volatile __PWM4CLKCONbits_t PWM4CLKCONbits;

#define _PWM4CLKCON_PWM4CS0     0x01
#define _PWM4CLKCON_CS0         0x01
#define _PWM4CLKCON_PWM4CS1     0x02
#define _PWM4CLKCON_CS1         0x02
#define _PWM4CLKCON_PWM4PS0     0x10
#define _PWM4CLKCON_PS0         0x10
#define _PWM4CLKCON_PWM4PS1     0x20
#define _PWM4CLKCON_PS1         0x20
#define _PWM4CLKCON_PWM4PS2     0x40
#define _PWM4CLKCON_PS2         0x40

//==============================================================================


//==============================================================================
//        PWM4LDCON Bits

extern __at(0x0DCF) __sfr PWM4LDCON;

typedef union
  {
  struct
    {
    unsigned PWM4LDS0           : 1;
    unsigned PWM4LDS1           : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned LDT                : 1;
    unsigned LDA                : 1;
    };

  struct
    {
    unsigned LDS0               : 1;
    unsigned LDS1               : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned PWM4LDM            : 1;
    unsigned PWM4LD             : 1;
    };

  struct
    {
    unsigned LDS                : 2;
    unsigned                    : 6;
    };

  struct
    {
    unsigned PWM4LDS            : 2;
    unsigned                    : 6;
    };
  } __PWM4LDCONbits_t;

extern __at(0x0DCF) volatile __PWM4LDCONbits_t PWM4LDCONbits;

#define _PWM4LDCON_PWM4LDS0     0x01
#define _PWM4LDCON_LDS0         0x01
#define _PWM4LDCON_PWM4LDS1     0x02
#define _PWM4LDCON_LDS1         0x02
#define _PWM4LDCON_LDT          0x40
#define _PWM4LDCON_PWM4LDM      0x40
#define _PWM4LDCON_LDA          0x80
#define _PWM4LDCON_PWM4LD       0x80

//==============================================================================


//==============================================================================
//        PWM4OFCON Bits

extern __at(0x0DD0) __sfr PWM4OFCON;

typedef union
  {
  struct
    {
    unsigned PWM4OFS0           : 1;
    unsigned PWM4OFS1           : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned OFO                : 1;
    unsigned PWM4OFM0           : 1;
    unsigned PWM4OFM1           : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned OFS0               : 1;
    unsigned OFS1               : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned PWM4OFMC           : 1;
    unsigned OFM0               : 1;
    unsigned OFM1               : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned OFS                : 2;
    unsigned                    : 6;
    };

  struct
    {
    unsigned PWM4OFS            : 2;
    unsigned                    : 6;
    };

  struct
    {
    unsigned                    : 5;
    unsigned OFM                : 2;
    unsigned                    : 1;
    };

  struct
    {
    unsigned                    : 5;
    unsigned PWM4OFM            : 2;
    unsigned                    : 1;
    };
  } __PWM4OFCONbits_t;

